# Напишите программу в которой пользователи будут задавать две строки а программа определять колличество вхождения одной строки в другую
# string= 'строка любая'
# subString = 'wen'

string= 'wen строка wen любаяwen '
subString = 'wen'
print(string.count(subString))